Repository: juhe-it-solutions/contao-openai-assistant
Catalog: contao/languages/*/*_module.xlf
Languages: de

# FMD.ai_chat.0
source: AI-Chatbot
de: KI-Chatbot

# FMD.ai_chat.1
source: Adds an AI-powered chat widget to your website
de: Fügt ein KI-gesteuertes Chat-Widget zu Ihrer Website hinzu

# tl_module.chat_legend
source: Chat Settings
de: Chat-Einstellungen

# tl_module.chatPosition.1
source: Select where the chat widget should appear on the page
de: Wählen Sie, wo das Chat-Widget auf der Seite erscheinen soll.

# tl_module.chatPosition.right-bottom
source: Right bottom
de: Rechts unten

# tl_module.chatPosition.right-center
source: Right center
de: Rechts mittig

# tl_module.chatPosition.left-bottom
source: Left bottom
de: Links unten

# tl_module.chatPosition.left-center
source: Left center
de: Links mittig

# tl_module.chat_title.0
source: Chat Title
de: Chat-Titel

# tl_module.chat_title.1
source: Title displayed in the chat widget header
de: Titel, der im Chat-Widget-Header angezeigt wird

# tl_module.welcome_message.0
source: Welcome Message
de: Willkommensnachricht

# tl_module.welcome_message.1
source: Message displayed in the chat input placeholder
de: Nachricht, die als Platzhalter im Chat-Eingabefeld angezeigt wird

# tl_module.initial_bot_message.0
source: Initial Bot Message
de: Erste Bot-Nachricht

# tl_module.initial_bot_message.1
source: First message displayed by the bot when chat opens
de: Erste Nachricht, die vom Bot angezeigt wird, wenn der Chat geöffnet wird

# tl_module.initial_state.0
source: Initial State
de: Anfangsstatus

# tl_module.initial_state.1
source: Select whether the chat should start expanded or collapsed
de: Wählen Sie, ob der Chat erweitert oder eingeklappt starten soll

# tl_module.initial_state.collapsed
source: Collapsed (show toggle button)
de: Eingeklappt (Toggle-Button anzeigen)

# tl_module.initial_state.expanded
source: Expanded (show chat window)
de: Erweitert (Chat-Fenster anzeigen, auf Mobilgeräten immer eingeklappt)

# tl_module.base_font_size.0
source: Base Font Size
de: Basis-Schriftgröße

# tl_module.base_font_size.1
source: Select the base font size for the chat widget. All other font sizes will scale proportionally.
de: Wählen Sie die Basis-Schriftgröße für das Chat-Widget. Alle anderen Schriftgrößen werden proportional skaliert.

# tl_module.base_font_size.12px
source: 12px - Small
de: 12px - Klein

# tl_module.base_font_size.14px
source: 14px - Default
de: 14px - Standard

# tl_module.base_font_size.16px
source: 16px - Medium
de: 16px - Mittel

# tl_module.base_font_size.18px
source: 18px - Large
de: 18px - Groß

# tl_module.base_font_size.20px
source: 20px - Extra Large
de: 20px - Sehr groß

# tl_module.colors_legend
source: Color Settings
de: Farbeinstellungen

# tl_module.dark_bg_primary.0
source: Dark Theme - Primary Background
de: Dunkles Theme - Primärer Hintergrund

# tl_module.dark_bg_primary.1
source: Primary background color for dark theme
de: Primäre Hintergrundfarbe für dunkles Theme

# tl_module.dark_bg_secondary.0
source: Dark Theme - Secondary Background
de: Dunkles Theme - Sekundärer Hintergrund

# tl_module.dark_bg_secondary.1
source: Secondary background color for dark theme
de: Sekundäre Hintergrundfarbe für dunkles Theme

# tl_module.dark_text_primary.0
source: Dark Theme - Primary Text
de: Dunkles Theme - Primärer Text

# tl_module.dark_text_primary.1
source: Primary text color for dark theme
de: Primäre Textfarbe für dunkles Theme

# tl_module.dark_text_secondary.0
source: Dark Theme - Secondary Text
de: Dunkles Theme - Sekundärer Text

# tl_module.dark_text_secondary.1
source: Secondary text color for dark theme
de: Sekundäre Textfarbe für dunkles Theme

# tl_module.light_bg_primary.0
source: Light Theme - Primary Background
de: Helles Theme - Primärer Hintergrund

# tl_module.light_bg_primary.1
source: Primary background color for light theme
de: Primäre Hintergrundfarbe für helles Theme

# tl_module.light_bg_secondary.0
source: Light Theme - Secondary Background
de: Helles Theme - Sekundärer Hintergrund

# tl_module.light_bg_secondary.1
source: Secondary background color for light theme
de: Sekundäre Hintergrundfarbe für helles Theme

# tl_module.light_text_primary.0
source: Light Theme - Primary Text
de: Helles Theme - Primärer Text

# tl_module.light_text_primary.1
source: Primary text color for light theme
de: Primäre Textfarbe für helles Theme

# tl_module.light_text_secondary.0
source: Light Theme - Secondary Text
de: Helles Theme - Sekundärer Text

# tl_module.light_text_secondary.1
source: Secondary text color for light theme
de: Sekundäre Textfarbe für helles Theme

# tl_module.dark_toggle_icon_color.0
source: Dark Theme - Toggle Button & Icon Color
de: Dunkles Theme - Farbe Toggle Button & Icons

# tl_module.dark_toggle_icon_color.1
source: Color for toggle buttons and icons in dark theme (6-digit hex code without #)
de: Farbe für Toggle-Buttons und Icons im dunklen Theme (6-stelliger Hex-Code ohne #)

# tl_module.light_toggle_icon_color.0
source: Light Theme - Toggle Button & Icon Color
de: Helles Theme - Farbe Toggle Button & Icons

# tl_module.light_toggle_icon_color.1
source: Color for toggle buttons and icons in light theme (6-digit hex code without #)
de: Farbe für Toggle-Buttons und Icons im hellen Theme (6-stelliger Hex-Code ohne #)
